In [43]:
import pandas as pd
import numpy as np

In [53]:
df = pd.DataFrame(
    {'Name': ['Alice', 'Bob', 'Aritra'],
    'Age': [25, 30, 35],
    'Location': ['Seattle', 'New York', 'Kona']
    },
    index=([10, 20, 30])
)
df

      Name  Age  Location
10   Alice   25   Seattle
20     Bob   30  New York
30  Aritra   35      Kona

In [58]:
df.index

Index([100, 200, 300], dtype='int64')

In [55]:
df.index = [100, 200, 300]
df

       Name  Age  Location
100   Alice   25   Seattle
200     Bob   30  New York
300  Aritra   35      Kona